# Data Engineering Syntax Assesment

## Question 1

In [1]:
### importing required libraries
import pandas as pd
import numpy as np

C:\Users\Sashank\anaconda3\envs\project\lib\site-packages\numpy\_distributor_init.py:30: UserWarning: loaded more than 1 DLL from .libs:
C:\Users\Sashank\anaconda3\envs\project\lib\site-packages\numpy\.libs\libopenblas.PYQHXLVVQ7VESDPUVUADXEVJOBGHJPAY.gfortran-win_amd64.dll
C:\Users\Sashank\anaconda3\envs\project\lib\site-packages\numpy\.libs\libopenblas.WCDJNK7YVMPZQ2ME2ZZHJJRJ3JIKNDB7.gfortran-win_amd64.dll
  warnings.warn("loaded more than 1 DLL from .libs:"

In [2]:
###  Creating DataFrame 
data_dict={'name':['Andy','Jose','Dieu','Chloe','Jose'],
'continent':['America','Europe','Asia','America','Europe'],
'college':['Lib Arts','Business','Engineering','Engineering','Business']}

In [3]:
students=pd.DataFrame(data_dict)

In [4]:
students

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Asia  Engineering
3  Chloe   America  Engineering
4   Jose    Europe     Business

In [5]:
### Dropping duplicate values
students=students.drop_duplicates()

In [6]:
students

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Asia  Engineering
3  Chloe   America  Engineering

In [7]:
### Creating Pivot Table
counts=pd.pivot_table(data=students, 
                        index=['college'], 
                        columns=['continent'],
                        values='name',
                        aggfunc='count',
                        fill_value=0,
                        margins=False,
                        ).sort_values(by='college',ascending=False)

In [8]:
counts

continent    America  Asia  Europe
college
Lib Arts           1     0       0
Engineering        1     1       0
Business           0     0       1

## Question 2

### A)

In [9]:
# Creating Data Frame
data_dict_2={'month':['jan','feb','mar','apr','may','jun'],
             'eggs':[47,110,221,77,132,205],
            'salt':[12.0,50.0,89.0,87.0,0.0,60.0],
            'spam':[17,31,72,20,52,55]}
df=pd.DataFrame(data_dict_2)

In [10]:
df=df.set_index('month')

In [11]:
df

       eggs  salt  spam
month
jan      47  12.0    17
feb     110  50.0    31
mar     221  89.0    72
apr      77  87.0    20
may     132   0.0    52
jun     205  60.0    55

In [12]:
## Option A
(df.loc[['apr', 'may', 'jun'],]['eggs'] > 100).sum()

2

### B)

In [13]:
import datetime

In [14]:
## Option A strptime,date()
datetime.datetime.strptime('01012018','%d%m%Y').date()

datetime.date(2018, 1, 1)

### C)

In [15]:
## Option B
# iris.loc[(iris[‘Species’] == ‘setosa’) & (iris[‘Petal.Width’] > 2)].sort_values(‘Sepal.Length’, ascending = False)

In [16]:
import seaborn
iris = seaborn.load_dataset("iris")

In [17]:
iris.loc[(iris['species'] == 'setosa') & (iris['petal_width'] > 2)].sort_values('sepal_length', ascending = False)

Empty DataFrame
Columns: [sepal_length, sepal_width, petal_length, petal_width, species]
Index: []